In [1]:
 import pandas as pd

# Creating A Dataframe

In [2]:
data = {
 'StudentID': [1, 2, 3, 4, 5, 6],
 'Name': ['ANIKET', 'SHREYAS', 'SHIVAM', 'VAJRESH', 'AAYUSH', 'HARSH'],
 'Age': [20, 22, 21, 23, 24, 25],
 'Grade': ['A', 'B', 'A', 'C', 'A','C'],
 'Marks':[89, 75, 80, 65, 85, 89]
}
df = pd.DataFrame(data)
print(df)

   StudentID     Name  Age Grade  Marks
0          1   ANIKET   20     A     89
1          2  SHREYAS   22     B     75
2          3   SHIVAM   21     A     80
3          4  VAJRESH   23     C     65
4          5   AAYUSH   24     A     85
5          6    HARSH   25     C     89

# Df Save To Excel File

In [3]:
excel_filename = 'data.xlsx'
df.to_excel(excel_filename)

In [4]:
df.head(2)

   StudentID     Name  Age Grade  Marks
0          1   ANIKET   20     A     89
1          2  SHREYAS   22     B     75

In [11]:
df.tail()

   StudentID     Name  Age Grade  Marks
1          2  SHREYAS   22     B     75
2          3   SHIVAM   21     A     80
3          4  VAJRESH   23     C     65
4          5   AAYUSH   24     A     85
5          6    HARSH   25     C     89

In [6]:
df.shape

(6, 5)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  6 non-null      int64
 1   Name       6 non-null      object
 2   Age        6 non-null      int64
 3   Grade      6 non-null      object
 4   Marks      6 non-null      int64
dtypes: int64(3), object(2)
memory usage: 372.0+ bytes

In [13]:
df.describe()

       StudentID        Age      Marks
count   6.000000   6.000000   6.000000
mean    3.500000  22.500000  80.500000
std     1.870829   1.870829   9.332738
min     1.000000  20.000000  65.000000
25%     2.250000  21.250000  76.250000
50%     3.500000  22.500000  82.500000
75%     4.750000  23.750000  88.000000
max     6.000000  25.000000  89.000000

In [14]:
df.transpose()

                0        1       2        3       4      5
StudentID       1        2       3        4       5      6
Name       ANIKET  SHREYAS  SHIVAM  VAJRESH  AAYUSH  HARSH
Age            20       22      21       23      24     25
Grade           A        B       A        C       A      C
Marks          89       75      80       65      85     89

# Reversing The DF

In [15]:
df.iloc[::-1]

   StudentID     Name  Age Grade  Marks
5          6    HARSH   25     C     89
4          5   AAYUSH   24     A     85
3          4  VAJRESH   23     C     65
2          3   SHIVAM   21     A     80
1          2  SHREYAS   22     B     75
0          1   ANIKET   20     A     89

# Slicing

In [16]:
df.iloc[1:3]

   StudentID     Name  Age Grade  Marks
1          2  SHREYAS   22     B     75
2          3   SHIVAM   21     A     80

In [17]:
df.set_index("StudentID")

              Name  Age Grade  Marks
StudentID
1           ANIKET   20     A     89
2          SHREYAS   22     B     75
3           SHIVAM   21     A     80
4          VAJRESH   23     C     65
5           AAYUSH   24     A     85
6            HARSH   25     C     89

In [18]:
df[df['Name'].str.startswith('S')]

   StudentID     Name  Age Grade  Marks
1          2  SHREYAS   22     B     75
2          3   SHIVAM   21     A     80

In [19]:
data1={
 'City':['Sangli', 'Satara', 'Kolhapur', 'Sangli', 'Kolhapur', 'Sangli']
}
df1 = pd.DataFrame(data1)
df1

       City
0    Sangli
1    Satara
2  Kolhapur
3    Sangli
4  Kolhapur
5    Sangli

In [20]:
list(zip(df,df1))

[('StudentID', 'City')]